
from tkinter import *

import random


text = """


(ა) „რა წამეკიდა,ყველაი წვრილად გიამბო ენითა,
(ბ) მერმეღა გაბრჭევ მართალი მაგა გულითა ბრძენითა;
(გ) შენ მოგელოდი, მიმჭირდა მოლოდინითა შენითა,
(დ) ქვაბს ვეღარ გავსძელ, მინდორთა მოვლა მომინდა ცხენითა.



(ა) „იმა ქედსა გარდავადეგ, შამბნი ისი მომეარნეს;
(ბ) ერთი ლომი, ერთი ვეფხი შეკრბეს, ერთგან შეიყარნეს.
(გ) ჰგვანდეს რათმე მოყვარულთა, მათი ნახვა გამეხარნეს,
(დ) მათ რა უყვეს ერთმანერთსა, გამიკვირდეს, შემეზარნეს.



(ა) „ქედსა გარდავდეგ, ლომ-ვეფხი მოვიდეს ორგნით რებულნი.
(ბ) სახედ ვამსგავსენ მიჯნურთა, ცეცხლნი დამევსნეს დებულნი.
(გ) შეიყარნეს და შეიბნეს, იბრძოდეს გამწარებულნი.
(დ) ლომი სდევს, ვეფხი მიურბის, იყვნეს არ ჩემგან ქებულნი.



(ა) „პირველ ამოდ ილაღობეს, მერმე მედგრად წაიკიდნეს:
(ბ) თვითო ტოტი ერთმანერთსა ჰკრეს, სიკვდილსა არ დაჰრიდნეს;
(გ) გამოჰრიდნა ვეფხმან – გული დედათამცა გამოჰრიდნეს!
(დ) ლომი მედგრად გაეკიდა, იგი ვერვინ დაამშვიდნეს.



(ა) „ლომსა დავუგმე ნაქმარი, ვარქვი: „არა ხარ ცნობასა,
(ბ) შენ საყვარელსა რად აწყენ? ფუ მაგა მამაცობასა!“
(გ) ხრმალ-გამოწვდილი გავუხე, მივეც ლახვართა სობასა,
(დ) თავსა გარდავჰკარ, მო-ცა-ვკალ, დავხსენ სოფლისა თმობასა.



(ა) „ხრმალი გავსტყორცე, გარდვიჭერ, ვეფხი შევიპყარ ხელითა,
(ბ) მის გამო კოცნა მომინდა, ვინ მწვავს ცეცხლითა ცხელითა,
(გ) მიღრინვიდა და მაწყენდა ბრჭკალითა სისხლთა მღვრელითა,
(დ) ვეღარ გავუძელ, იგიცა მოვკალ გულითა ხელითა.



(ა) „რაზომსაცა ვამშვიდებდი, ვეფხი ვერათ დავამშვიდე,
(ბ) გავგულისდი, მოვიქნივე, ვჰკარ მიწასა, დავაწყვიდე,
(გ) მომეგონა, ოდეს ჩემსა საყვარელსა წავეკიდე;
(დ) სულნი სრულად არ ამომხდეს, რად გიკვირს, თუ ცრემლსა ვღვრიდე!



(ა) „აჰა, ძმაო, მითხრობია ჭირი ჩემი, რაცა მჭირდა;
(ბ) სულთა დგმაცა არა მმართებს, ასრე გასლვა რად გიკვირდა!
(გ) სიცოცხლესა გავეყარე, სიკვდილიცა დამიძვირდა “.
(დ) ესე სიტყვა დაასრულა, ყმამან სულთქვნა, ა-ცა-ტირდა.



(ა) ავთანდილცა მასთანავე ტიროდა და ცრემლსა ღვრიდა,
(ბ) უთხრა: „დათმე, ნუ მოჰკვდები, გულსა სრულად ნუ დასჭრი, და-!
(გ) ღმერთი მაგას მოწყალეობს, თუცა ჭირმან არ გაგრიდა;
(დ) თუმც უნდოდით გასაყრელად, პირველ ერთგან არ შეგყრიდა.



(ა) „სდევს მიჯნურსა ფათერაკი, საწუთროსა დაანავღლებს,
(ბ) მაგრა ბოლოდ ლხინსა მისცემს, ვინცა პირველ ჭირსა გასძლებს;
(გ) მიჯნურობა საჭიროა, მით სიკვდილსა მიგვაახლებს,
(დ) გასწავლულსა გააშმაგებს, უსწავლელსა გაასწავლებს“. """


def rundom():
    paragraphs = text.split("\n\n")
    random_paragraph = random.choice(paragraphs)
    print(random_paragraph)

window = Tk() 
button = Button(window,
                text='RANDOM!',
                command=rundom,
                font=("Comic Sans", 24),
                fg="#00ff00",
                bg="#6b662f",
                activeforeground="#00ff00",
                activebackground="#6b662f",
                compound="bottom",
                padx=20,
                pady=20)
button.pack()
window.mainloop()
